task/single-software/cli/openfoam/task-12/init_file/pipe_base/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS; // TODO_SIMULATION_TYPE

RAS
{
    model           realizableKE; // TODO_TURB_MODEL

    turbulence      on; // TODO_TURB_SWITCH

    printCoeffs     on;
}


// ************************************************************************* //
